# DataFrames
- Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

- Series is like a column, a DataFrame is the whole table.

- A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns

## Create DataFrame using different Data Types

In [2]:
import pandas as pd

- Using list

In [22]:
lst = [1, 9.3, 'a']
df1 = pd.DataFrame(lst)
df1

     0
0    1
1  9.3
2    a

- Using tuple

In [23]:
tup = (3, 5.8, 'b')
df2 = pd.DataFrame(tup)
df2

     0
0    3
1  5.8
2    b

- Using dictionary

In [24]:
mydict = {'name':['Vivek', 'Alex', 'Bob'], 'age':[23, 20, 18]}
df3 = pd.DataFrame(mydict)
df3

    name  age
0  Vivek   23
1   Alex   20
2    Bob   18

- Using single Series

In [25]:
sr1 = pd.Series(['Apple', 'Orange', 'Banana'], name = 'fruits')
df4 = pd.DataFrame(sr1)
df4

   fruits
0   Apple
1  Orange
2  Banana

- Using multiple Series

In [26]:
sr1 = pd.Series([3, 2, 5])
sr2 = pd.Series(['Apple', 'Orange', 'Banana'])
dict_series = {'id': sr1, 'fruit': sr2}
df5 = pd.DataFrame(dict_series)
df5

   id   fruit
0   3   Apple
1   2  Orange
2   5  Banana

## Optional Arguments
- `index`: To assign custom index to the rows of DataFrame
- `columns`: To assign custom name to the columns of a DataFrame

In [19]:
lst = [['Vivek', 23, 'Pune'], ['Ram', 40, 'Banglore'], ['Ankit', 32, 'Delhi']]
df = pd.DataFrame(lst, index = ['id1','id2','id3'], columns = ['name','age', 'city'])
print(df['name']['id3'])
df

Ankit

      name  age      city
id1  Vivek   23      Pune
id2    Ram   40  Banglore
id3  Ankit   32     Delhi

- `columns` is also used to splice dictionary while creating the DataFrame from it

In [20]:
mydict = {'name':['Vivek','Alex','Bob'], 'age':[23, 20, 18], 'city':['Pune','Delhi','Mumbai']}
df = pd.DataFrame(mydict, columns=['name','city'])
df

    name    city
0  Vivek    Pune
1   Alex   Delhi
2    Bob  Mumbai

- `dtye`:  It is used to typecast the elements of the DataFrame

In [21]:
lst = [[1.5, 2.8, 60.8], [52.5, 50.5, 98.2], [65.15, 60.15,98.6]]
df = pd.DataFrame(lst, dtype=int)
df

C:\Users\jadha\AppData\Local\Temp\ipykernel_8464\3065142193.py:2: FutureWarning: In a future version, passing float-dtype values and an integer dtype to DataFrame will retain floating dtype if they cannot be cast losslessly (matching Series behavior). To retain the old behavior, use DataFrame(data).astype(dtype)
  df = pd.DataFrame(lst, dtype=int)

    0   1   2
0   1   2  60
1  52  50  98
2  65  60  98